Revit 2027 API
ParameterTypeId.SectionBrokenDisplayStyle Property
 "Broken Section Display Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SectionBrokenDisplayStyle { get; }
Public Shared ReadOnly Property SectionBrokenDisplayStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SectionBrokenDisplayStyle {
	ForgeTypeId^ get ();
}
static member SectionBrokenDisplayStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace